# IFCProperty Mapping Info Properties

Source: https://www.revitapidocs.com/2026/ef523d7b-f0f2-cb88-eaec-49c76662e1c0.htm

---

| IFCProperty Mapping Info Properties |
| --- |

The IFCPropertyMappingInfo type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | ExportFlag | Whether or not the property is included in export. |
|  | IFCPropertyName | The IFC property name. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | RevitPropertyId | The Revit property id. |
|  | RevitPropertyName | The Revit property name. |

Top See Also

#### Reference

IFCPropertyMappingInfo Class Autodesk.Revit.DB Namespace